7767517
82 93
Input                    input0                   0 1 input0 -23330=4,3,320,240,3 0=320 1=240 2=3
Convolution              199                      1 1 input0 201 -23330=4,3,160,120,16 0=16 1=3 3=2 4=1 5=1 6=432 9=1
ConvolutionDepthWise     202                      1 1 201 204 -23330=4,3,160,120,16 0=16 1=3 4=1 5=1 6=144 7=16 9=1
Convolution              205                      1 1 204 207 -23330=4,3,160,120,32 0=32 1=1 5=1 6=512 9=1
ConvolutionDepthWise     208                      1 1 207 210 -23330=4,3,80,60,32 0=32 1=3 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              211                      1 1 210 213 -23330=4,3,80,60,32 0=32 1=1 5=1 6=1024 9=1
ConvolutionDepthWise     214                      1 1 213 216 -23330=4,3,80,60,32 0=32 1=3 4=1 5=1 6=288 7=32 9=1
Convolution              217                      1 1 216 219 -23330=4,3,80,60,32 0=32 1=1 5=1 6=1024 9=1
ConvolutionDepthWise     220                      1 1 219 222 -23330=4,3,40,30,32 0=32 1=3 3=2 4=1 5=1 6=288 7=32 9=1
Convolution              223                      1 1 222 225 -23330=4,3,40,30,64 0=64 1=1 5=1 6=2048 9=1
ConvolutionDepthWise     226                      1 1 225 228 -23330=4,3,40,30,64 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              229                      1 1 228 231 -23330=4,3,40,30,64 0=64 1=1 5=1 6=4096 9=1
ConvolutionDepthWise     232                      1 1 231 234 -23330=4,3,40,30,64 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              235                      1 1 234 237 -23330=4,3,40,30,64 0=64 1=1 5=1 6=4096 9=1
ConvolutionDepthWise     238                      1 1 237 240 -23330=4,3,40,30,64 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              241                      1 1 240 243 -23330=4,3,40,30,64 0=64 1=1 5=1 6=4096 9=1
Split                    splitncnn_0              1 4 243 243_splitncnn_0 243_splitncnn_1 243_splitncnn_2 243_splitncnn_3 -23330=16,3,40,30,64,3,40,30,64,3,40,30,64,3,40,30,64
ConvolutionDepthWise     244                      1 1 243_splitncnn_3 246 -23330=4,3,20,15,64 0=64 1=3 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              247                      1 1 246 249 -23330=4,3,20,15,128 0=128 1=1 5=1 6=8192 9=1
ConvolutionDepthWise     250                      1 1 249 252 -23330=4,3,20,15,128 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              253                      1 1 252 255 -23330=4,3,20,15,128 0=128 1=1 5=1 6=16384 9=1
ConvolutionDepthWise     256                      1 1 255 258 -23330=4,3,20,15,128 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              259                      1 1 258 261 -23330=4,3,20,15,128 0=128 1=1 5=1 6=16384 9=1
Split                    splitncnn_1              1 4 261 261_splitncnn_0 261_splitncnn_1 261_splitncnn_2 261_splitncnn_3 -23330=16,3,20,15,128,3,20,15,128,3,20,15,128,3,20,15,128
ConvolutionDepthWise     262                      1 1 261_splitncnn_3 264 -23330=4,3,10,8,128 0=128 1=3 3=2 4=1 5=1 6=1152 7=128 9=1
Convolution              265                      1 1 264 267 -23330=4,3,10,8,256 0=256 1=1 5=1 6=32768 9=1
ConvolutionDepthWise     268                      1 1 267 270 -23330=4,3,10,8,256 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              271                      1 1 270 273 -23330=4,3,10,8,256 0=256 1=1 5=1 6=65536 9=1
Split                    splitncnn_2              1 4 273 273_splitncnn_0 273_splitncnn_1 273_splitncnn_2 273_splitncnn_3 -23330=16,3,10,8,256,3,10,8,256,3,10,8,256,3,10,8,256
Convolution              274                      1 1 273_splitncnn_3 275 -23330=4,3,10,8,64 0=64 1=1 5=1 6=16384 9=1
ConvolutionDepthWise     276                      1 1 275 277 -23330=4,3,5,4,64 0=64 1=3 3=2 4=1 5=1 6=576 7=64 9=1
Convolution              278                      1 1 277 279 -23330=4,3,5,4,256 0=256 1=1 5=1 6=16384 9=1
Split                    splitncnn_3              1 3 279 279_splitncnn_0 279_splitncnn_1 279_splitncnn_2 -23330=12,3,5,4,256,3,5,4,256,3,5,4,256
ConvolutionDepthWise     280                      1 1 243_splitncnn_2 281 -23330=4,3,40,30,64 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              282                      1 1 281 282 -23330=4,3,40,30,12 0=12 1=1 5=1 6=768
Permute                  283                      1 1 282 283 -23330=4,3,12,40,30 0=3
ConvolutionDepthWise     284                      1 1 243_splitncnn_1 285 -23330=4,3,40,30,64 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              286                      1 1 285 286 -23330=4,3,40,30,6 0=6 1=1 5=1 6=384
Permute                  287                      1 1 286 287 -23330=4,3,6,40,30 0=3
ConvolutionDepthWise     288                      1 1 243_splitncnn_0 289 -23330=4,3,40,30,64 0=64 1=3 4=1 5=1 6=576 7=64 9=1
Convolution              290                      1 1 289 290 -23330=4,3,40,30,24 0=24 1=1 5=1 6=1536
Permute                  291                      1 1 290 291 -23330=4,3,24,40,30 0=3
ConvolutionDepthWise     292                      1 1 261_splitncnn_2 293 -23330=4,3,20,15,128 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              294                      1 1 293 294 -23330=4,3,20,15,8 0=8 1=1 5=1 6=1024
Permute                  295                      1 1 294 295 -23330=4,3,8,20,15 0=3
ConvolutionDepthWise     296                      1 1 261_splitncnn_1 297 -23330=4,3,20,15,128 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              298                      1 1 297 298 -23330=4,3,20,15,4 0=4 1=1 5=1 6=512
Permute                  299                      1 1 298 299 -23330=4,3,4,20,15 0=3
ConvolutionDepthWise     300                      1 1 261_splitncnn_0 301 -23330=4,3,20,15,128 0=128 1=3 4=1 5=1 6=1152 7=128 9=1
Convolution              302                      1 1 301 302 -23330=4,3,20,15,16 0=16 1=1 5=1 6=2048
Permute                  303                      1 1 302 303 -23330=4,3,16,20,15 0=3
ConvolutionDepthWise     304                      1 1 273_splitncnn_2 305 -23330=4,3,10,8,256 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              306                      1 1 305 306 -23330=4,3,10,8,8 0=8 1=1 5=1 6=2048
Permute                  307                      1 1 306 307 -23330=4,3,8,10,8 0=3
ConvolutionDepthWise     308                      1 1 273_splitncnn_1 309 -23330=4,3,10,8,256 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              310                      1 1 309 310 -23330=4,3,10,8,4 0=4 1=1 5=1 6=1024
Permute                  311                      1 1 310 311 -23330=4,3,4,10,8 0=3
ConvolutionDepthWise     312                      1 1 273_splitncnn_0 313 -23330=4,3,10,8,256 0=256 1=3 4=1 5=1 6=2304 7=256 9=1
Convolution              314                      1 1 313 314 -23330=4,3,10,8,16 0=16 1=1 5=1 6=4096
Permute                  315                      1 1 314 315 -23330=4,3,16,10,8 0=3
Convolution              316                      1 1 279_splitncnn_2 316 -23330=4,3,5,4,12 0=12 1=3 4=1 5=1 6=27648
Permute                  317                      1 1 316 317 -23330=4,3,12,5,4 0=3
Convolution              318                      1 1 279_splitncnn_1 318 -23330=4,3,5,4,6 0=6 1=3 4=1 5=1 6=13824
Permute                  319                      1 1 318 319 -23330=4,3,6,5,4 0=3
Convolution              320                      1 1 279_splitncnn_0 320 -23330=4,3,5,4,24 0=24 1=3 4=1 5=1 6=55296
Permute                  321                      1 1 320 321 -23330=4,3,24,5,4 0=3
Reshape                  331                      1 1 283 331 -23330=4,2,4,3600,1 0=4 1=-1
Reshape                  341                      1 1 295 341 -23330=4,2,4,600,1 0=4 1=-1
Reshape                  351                      1 1 307 351 -23330=4,2,4,160,1 0=4 1=-1
Reshape                  361                      1 1 317 361 -23330=4,2,4,60,1 0=4 1=-1
Concat                   output0                  4 1 331 341 351 361 output0 -23330=4,2,4,4420,1
Reshape                  372                      1 1 287 372 -23330=4,2,2,3600,1 0=2 1=-1
Reshape                  382                      1 1 299 382 -23330=4,2,2,600,1 0=2 1=-1
Reshape                  392                      1 1 311 392 -23330=4,2,2,160,1 0=2 1=-1
Reshape                  402                      1 1 319 402 -23330=4,2,2,60,1 0=2 1=-1
Concat                   403                      4 1 372 382 392 402 403 -23330=4,2,2,4420,1
Reshape                  413                      1 1 291 413 -23330=4,2,8,3600,1 0=8 1=-1
Reshape                  423                      1 1 303 423 -23330=4,2,8,600,1 0=8 1=-1
Reshape                  433                      1 1 315 433 -23330=4,2,8,160,1 0=8 1=-1
Reshape                  443                      1 1 321 443 -23330=4,2,8,60,1 0=8 1=-1
Concat                   444                      4 1 413 423 433 443 529 -23330=4,2,8,4420,1
Softmax                  445                      1 1 403 530 -23330=4,2,2,4420,1 0=1 1=1
